<a href="https://colab.research.google.com/github/xuhu357/DataAnalysis/blob/master/ch05_Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
from pandas import Series, DataFrame

import pandas as pd

import numpy as np

### 상관관계와 공분산

In [2]:
!pip install pandas_datareader

Requirement already satisfied: pandas_datareader in /usr/local/lib/python3.6/dist-packages (0.7.0)
Requirement already satisfied: lxml in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (4.2.5)
Requirement already satisfied: wrapt in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (1.10.11)
Requirement already satisfied: requests>=2.3.0 in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (2.18.4)
Requirement already satisfied: pandas>=0.19.2 in /usr/local/lib/python3.6/dist-packages (from pandas_datareader) (0.22.0)
Requirement already satisfied: certifi>=2017.4.17 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (2018.11.29)
Requirement already satisfied: idna<2.7,>=2.5 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (2.6)
Requirement already satisfied: chardet<3.1.0,>=3.0.2 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (3.0.4)
Requirement already satisfied: urllib3<1.23,>=1.21.1 in /usr/local/lib/python3.6/dist-packages (from requests>=2.3.0->pandas_datareader) (1.22)
Requirement already satisfied: python-dateutil>=2 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (2.5.3)
Requirement already satisfied: numpy>=1.9.0 in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (1.14.6)
Requirement already satisfied: pytz>=2011k in /usr/local/lib/python3.6/dist-packages (from pandas>=0.19.2->pandas_datareader) (2018.7)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2->pandas>=0.19.2->pandas_datareader) (1.11.0)

In [0]:
import pandas as pd
from pandas_datareader import data

In [0]:
all_data = {}

for ticker in ['AAPL', 'IBM', 'MSFT','GOOG']:
  all_data[ticker] = data.DataReader(ticker, 'yahoo', '2015-01-01', '2016-01-01')
  
price = pd.DataFrame({tic: data['Adj Close'] for tic, data in all_data.items()})
volume = pd.DataFrame({tic: data['Volume'] for tic, data in all_data.items()})

In [0]:
returns = price.pct_change()

In [6]:
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013058 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

In [7]:
price.tail()

                  AAPL        GOOG         IBM       MSFT
Date
2015-12-24  102.467850  748.400024  121.488968  52.097908
2015-12-28  101.320145  762.510010  120.926575  52.359940
2015-12-29  103.141289  776.599976  122.833458  52.921440
2015-12-30  101.794418  771.000000  122.446838  52.696846
2015-12-31   99.840477  758.880005  120.935364  51.920101

corr 메소드는 NA가 아니고, 정렬된 색인에서 연속하는 두 Series에 대해서 상관 관계를 계산하고 cov메소드는 공분산을 계산

In [8]:
returns.MSFT.corr(returns.IBM)

0.5493783907495223

In [9]:
returns.MSFT.cov(returns.IBM)

0.00013072732105472176

In [10]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.381578  0.516632  0.523573
GOOG  0.381578  1.000000  0.453230  0.521243
IBM   0.516632  0.453230  1.000000  0.549378
MSFT  0.523573  0.521243  0.549378  1.000000

In [11]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000120  0.000116  0.000157
GOOG  0.000120  0.000346  0.000113  0.000173
IBM   0.000116  0.000113  0.000179  0.000131
MSFT  0.000157  0.000173  0.000131  0.000317

In [12]:
returns.corrwith(returns.IBM)

AAPL    0.516632
GOOG    0.453230
IBM     1.000000
MSFT    0.549378
dtype: float64

In [13]:
volume.head()

                  AAPL       GOOG        IBM        MSFT
Date
2015-01-02  53204600.0  1447600.0  5525500.0  27913900.0
2015-01-05  64285500.0  2059800.0  4880400.0  39673900.0
2015-01-06  65797100.0  2899900.0  6146700.0  36447900.0
2015-01-07  40105900.0  2065100.0  4701800.0  29114100.0
2015-01-08  59364500.0  3353600.0  4236800.0  29645200.0

In [14]:
returns.corrwith(volume)

AAPL   -0.119290
GOOG    0.406530
IBM    -0.302053
MSFT   -0.002987
dtype: float64

### 유일값, 값 세기, 멤버십

In [0]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [0]:
uniques = obj.unique()

In [17]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

Unique는 말그대로 유일한 값을 찾아주는 것이지, 정렬까지는 책임져 주지 않는다.

In [18]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [19]:
pd.value_counts(obj.values, sort=False)

a    3
d    1
b    2
c    3
dtype: int64

In [20]:
pd.value_counts(obj.values)

c    3
a    3
b    2
d    1
dtype: int64

특정 값을 가진 부분 row만을 선택하고 싶을 때,

In [0]:
mask = obj.isin(['b', 'd'])

In [22]:
mask

0    False
1    False
2     True
3    False
4    False
5     True
6     True
7    False
8    False
dtype: bool

In [23]:
obj[mask]

2    d
5    b
6    b
dtype: object

**정리해보면, **

* isin: Series의 각 원소가 넘겨 받은 연속된 값에 속하는지를 나타내는 불리언 배열을 반환.
* unique: Series에서 중복되는 값을 제거하고 , 유일한 값만 포함하는 배열을 반환. 결과는 Series에서 발견된 순서대로 반환.
* value_counts: Series에서 유일 값에 대한 색인 값과 도수를 계산. 결과는 도수 값의 내림차순으로 정렬.

In [0]:
data = DataFrame(
    {
        'Qu1': [1, 3, 4, 3, 4],
        'Qu2': [2, 3, 1, 2, 3], 
        'Qu3': [1, 5, 2, 4, 4]
    }
)

In [25]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [26]:
data.apply(pd.value_counts).fillna(0) # 없는 값은 0으로 채우자~

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [27]:
data.apply(pd.value_counts, axis=1).fillna(0) # column에 대해서 적용해보자

     1    2    3    4    5
0  2.0  1.0  0.0  0.0  0.0
1  0.0  0.0  2.0  0.0  1.0
2  1.0  1.0  0.0  1.0  0.0
3  0.0  1.0  1.0  1.0  0.0
4  0.0  0.0  1.0  2.0  0.0

## 누락된 데이터 처리하기

In [0]:
str_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [29]:
str_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [30]:
str_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [0]:
str_data[0] = None

In [32]:
str_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [33]:
str_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

**NA 처리 메소드**

* dropna: 누락된 데이터가 있는 축을 제외. 어느 정도 누락 데이터까지 용인할 것인지 지정 가능
* fillna: 누락된 데이터를 대신할 값을 채우거나 ffill 또는 bfill같은 보간 메소드를 적용
* isnull: 누락되거나 NA 값을 알려주는 불리언 값이 저장된, 같은 형태의 객체를 반환
* notnull: isnull과 반대되는 메소드

### 누락된 데이터 골라내기

In [0]:
from numpy import nan as NA

In [0]:
data = Series([1, NA, 3.5, NA, 7])

In [36]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [37]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [38]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

**DataFrame인 경우는 조금 복잡함**. 

모두 NA인 row, column을 제외하든가, 하나라도 NA인 값을 포함하고 있는 row, column을 제외 시킬수도 있다. dropna는 기본적으로 NA값이 하나라도 있는 row는 제외시킨다.

In [0]:
data = DataFrame([
    [1., 6.5, 3.], 
    [1., NA, NA], 
    [NA, NA, NA],
    [NA, 6.5, 3.]
])

In [40]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [0]:
cleaned = data.dropna()

In [42]:
cleaned

     0    1    2
0  1.0  6.5  3.0

dropna()는 옵션을 주지 않으면, NA가 하나라도 있으면 모두 drop 해버림.

In [43]:
data.dropna(how='all') # 모두 na일때에만 drop해라~

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [51]:
data.dropna(thresh=2) # NA가 thresh보다 같거나 큰애들을 drop 시켜라.

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.5  3.0

### 누락된 값 채우기

In [44]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [45]:
data.fillna(0)

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

일괄적으로 다 한개의 값으로 채우는것도 나쁘지는 않지만, 각 column별로 값을 다르게 주고 싶다면,

In [46]:
data.fillna({1: 100, 2: 200})

     0      1      2
0  1.0    6.5    3.0
1  1.0  100.0  200.0
2  NaN  100.0  200.0
3  NaN    6.5    3.0

In [47]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

보다 싶이 지금까지는 원본은 변경하지 않았음. 그러나 inplace=True를 통해서 원본을 변경 가능

In [0]:
data.fillna(0, inplace=True)

In [49]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  0.0  0.0
2  0.0  0.0  0.0
3  0.0  6.5  3.0

**Let's see another example~**

In [0]:
df = DataFrame(np.random.randn(6, 3))

In [0]:
df.iloc[2: , 1] = NA; df.iloc[4: , 2] = NA

In [52]:
df

          0         1         2
0 -0.304413 -1.721575 -0.561524
1 -0.959479 -1.363486  0.458727
2  0.799033       NaN -0.075438
3  1.346836       NaN -0.389948
4 -0.420924       NaN       NaN
5 -0.421729       NaN       NaN

In [53]:
df.fillna(method='ffill') # front fill? 값이 없으면, 내 앞의 값으로 채워라~

          0         1         2
0 -0.304413 -1.721575 -0.561524
1 -0.959479 -1.363486  0.458727
2  0.799033 -1.363486 -0.075438
3  1.346836 -1.363486 -0.389948
4 -0.420924 -1.363486 -0.389948
5 -0.421729 -1.363486 -0.389948

In [54]:
df.fillna(method='ffill', limit=2) # 이 메소드를 죽을때까지 우려먹지말고 limit을 주자, 여기는 2번까지만 사용해라~

          0         1         2
0 -0.304413 -1.721575 -0.561524
1 -0.959479 -1.363486  0.458727
2  0.799033 -1.363486 -0.075438
3  1.346836 -1.363486 -0.389948
4 -0.420924       NaN -0.389948
5 -0.421729       NaN -0.389948

another example~

In [0]:
data = Series([1., NA, 3.5, NA, 7])

In [56]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

이번에는 평균으로 채워보자~

In [57]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 계층적 색인 (Hierarchical indexing)

판다스의 주요 기능으로써, 축에 대한 다중 색인 단계를 지정할 수 있음.

추상적으로 표현하자면, 차원이 높은 데이터를 차원이 낮은 형식으로 다룰수 있게 해주는 기능

In [0]:
data = Series(np.random.randn(10), index = [['a', 'a', 'a', 'b', 'b', 'b', 'c','c', 'd', 'd'], [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])

In [59]:
data

a  1   -0.768029
   2    0.664488
   3   -0.376515
b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
d  2    0.279895
   3    0.035328
dtype: float64

In [60]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [61]:
data['b']

1    1.050230
2   -1.406699
3    1.925991
dtype: float64

In [62]:
data['d']

2    0.279895
3    0.035328
dtype: float64

In [63]:
data['b':'c']

b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
dtype: float64

In [64]:
data[['b', 'd']]

b  1    1.050230
   2   -1.406699
   3    1.925991
d  2    0.279895
   3    0.035328
dtype: float64

In [65]:
data['b', 2]

-1.4066994729069024

In [66]:
data[:, 3]

a   -0.376515
b    1.925991
d    0.035328
dtype: float64

계층적 색인은 데이터를 재형성, reshape하고, pivot_table 같은 그룹 기반의 작업을 할 때 중요하게 사용된다. 

예를 들어, DataFrame 객체에 unstack 메소드를 사용해서, 데이터를 새롭게 배열할 수 있다.

In [67]:
data

a  1   -0.768029
   2    0.664488
   3   -0.376515
b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
d  2    0.279895
   3    0.035328
dtype: float64

In [68]:
data.unstack(-1)

          1         2         3
a -0.768029  0.664488 -0.376515
b  1.050230 -1.406699  1.925991
c -0.906054  1.447778       NaN
d       NaN  0.279895  0.035328

In [69]:
data.unstack().unstack()

1  a   -0.768029
   b    1.050230
   c   -0.906054
   d         NaN
2  a    0.664488
   b   -1.406699
   c    1.447778
   d    0.279895
3  a   -0.376515
   b    1.925991
   c         NaN
   d    0.035328
dtype: float64

다시 돌아와서

In [70]:
data

a  1   -0.768029
   2    0.664488
   3   -0.376515
b  1    1.050230
   2   -1.406699
   3    1.925991
c  1   -0.906054
   2    1.447778
d  2    0.279895
   3    0.035328
dtype: float64

In [71]:
data.unstack(0)

          a         b         c         d
1 -0.768029  1.050230 -0.906054       NaN
2  0.664488 -1.406699  1.447778  0.279895
3 -0.376515  1.925991       NaN  0.035328

**DataFrame의 두축 모두 계층적 색인 가질수 있다. **

In [0]:
frame = DataFrame(np.arange(12).reshape((4, 3)), 
                 index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]], 
                  columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
                 )

In [74]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

**계층적 색인의 각 단계는 이름을 가질수 있고, 만약 이름이 있다면, 콘솔 출력 시에 함께 나타난다. **

In [0]:
frame.index.names = ['key1', 'key2']

In [76]:
frame

           Ohio     Colorado
          Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

Column에도 이름을 줘보자

In [0]:
frame.columns.names = ['State', 'Color']

In [78]:
frame

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [79]:
frame['Ohio']

Color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [80]:
frame.index.labels

FrozenList([[0, 0, 1, 1], [0, 1, 0, 1]])

In [81]:
frame.index.names

FrozenList(['key1', 'key2'])

이젠 본격적으로 data frame의 다중색인에 대해서 알아보자

In [82]:
frame

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [83]:
frame.index

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [84]:
frame.loc['a']

State  Ohio     Colorado
Color Green Red    Green
key2
1         0   1        2
2         3   4        5

In [85]:
frame.loc['a': 'b']

State      Ohio     Colorado
Color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

그럼 key1은 아무거나이고, key2가 2인 항목만 추출하고 싶다면, 어떻게 할까?

In [0]:
frame.loc['a':'b', 2] # 'a' ~ 'b' 까지, key2가 2인 애들만 뽑자인데

In [97]:
frame.loc[('a':'b', 2)]

SyntaxError: ignored

뭐지? 2를 column으로 준게 아닌데~ 2가 숫자여서 그런가? 그럼 문자 index로 다시 테스트

In [0]:
frame = DataFrame(np.arange(12).reshape((4, 3)), 
                 index=[['a', 'a', 'b', 'b'], ['one', 'two', 'one', 'two']], 
                  columns = [['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']]
                 )

In [89]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [90]:
frame.index

MultiIndex(levels=[['a', 'b'], ['one', 'two']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [91]:
frame.loc['b']

     Ohio     Colorado
    Green Red    Green
one     6   7        8
two     9  10       11

In [92]:
frame.loc['b', 'two']

Ohio      Green     9
          Red      10
Colorado  Green    11
Name: (b, two), dtype: int64

In [93]:
frame.loc[[('a', 'two'), ('b', 'two')]]

       Ohio     Colorado
      Green Red    Green
a two     3   4        5
b two     9  10       11

### 퀴즈, frame에서 key2가 'two' 인 데이터만 뽑고 싶다면, 어떻게 해야 할까요?

슬라이싱(:)을 써줘야 하는데 아래와 같이 쓰면, 에러 발생함.

In [0]:
frame.loc[:, 'two']

In [99]:
frame.loc[(:, 'two')]

SyntaxError: ignored

#### MultiIndexing에서는 슬라이싱을 slice로 표시

In [100]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [101]:
frame.loc[(slice('a', 'b'), 'two'), 'Colorado']

       Green
a two      5
b two     11

In [102]:
frame.loc[(slice(None), 'two'), 'Colorado']

       Green
a two      5
b two     11

혹은 판다스에서 제공하는 IndexSlice를 사용하자~

In [0]:
idx = pd.IndexSlice

In [104]:
frame

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
  two     3   4        5
b one     6   7        8
  two     9  10       11

In [105]:
frame.loc[idx[:, 'one'], :]

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
b one     6   7        8

In [106]:
frame.loc[(slice(None), 'one'), :]

       Ohio     Colorado
      Green Red    Green
a one     0   1        2
b one     6   7        8

In [107]:
frame.loc[(slice(None), slice(None)), 'Colorado']

       Green
a one      2
  two      5
b one      8
  two     11

DataFrame의 multi index에서 ' : ' 이 먹히지 않는게 신기했음.